     A*=====================================================================
     A* DBSDK Configuration Administration - Twilio Configuration Display
     A*=====================================================================
     A* Purpose: Twilio configuration screen for editing user settings
     A*
     A* Compilation:
     A*   CRTSRCPF FILE(QTEMP/QDDSSRC) RCDLEN(112)
     A*   CPYFRMSTMF FROMSTMF('/home/jwoehr/work/AI/DbToo/AI-SDK-Db2-IBMi/src/admin/dspf/CFGTWILIOD.dspf') +
     A*              TOMBR('/QSYS.LIB/QTEMP.LIB/QDDSSRC.FILE/CFGTWILIOD.MBR') +
     A*              MBROPT(*REPLACE)
     A*   CRTDSPF FILE(DBSDK_V1/CFGTWILIOD) SRCFILE(QTEMP/QDDSSRC) SRCMBR(CFGTWILIOD)
     A*
     A* Author: AI-SDK-Db2-IBMi Project
     A* Date: 2026-03-22
     A*=====================================================================
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      INDARA
     A                                      CA03(03 'Exit')
     A                                      CA12(12 'Cancel')
     A          R TWCONFIG
     A                                      OVERLAY
     A*=====================================================================
     A* Screen Title and Header
     A*=====================================================================
     A                                  1  2'DBSDK Configuration Administra-
     A                                      tion'
     A                                      DSPATR(HI)
     A                                  1 70TIME
     A                                  2  2'Twilio Configuration'
     A                                      DSPATR(UL)
     A                                  2 70DATE
     A                                      EDTCDE(Y)
     A*=====================================================================
     A* User Profile Display
     A*=====================================================================
     A                                  4  2'User Profile:'
     A            USRPRF        10A  B  4 17DSPATR(UL)
     A                                      COLOR(WHT)
     A*=====================================================================
     A* Configuration Fields
     A*=====================================================================
     A                                  6  2'Phone Number:'
     A            TWNUMBER      50A  B  6 20CHECK(LC)
     A                                  6 72'(1/2)'
     A                                      COLOR(BLU)
     A            TWNUMBR2      50A  B  8 20CHECK(LC)
     A                                  8 72'(2/2)'
     A                                      COLOR(BLU)
     A                                 10  2'Account SID:'
     A            TWSID         50A  B 10 20CHECK(LC)
     A                                 10 72'(1/2)'
     A                                      COLOR(BLU)
     A            TWSID2        50A  B 12 20CHECK(LC)
     A                                 12 72'(2/2)'
     A                                      COLOR(BLU)
     A                                 14  2'Auth Token:'
     A            TWAUTHTN      50A  B 14 20CHECK(LC)
     A                                      DSPATR(ND UL)
     A                                      COLOR(WHT)
     A                                 14 72'(1/2)'
     A                                      COLOR(BLU)
     A                                 15 20'^ Starts here'
     A                                      COLOR(BLU)
     A            TWAUTHK2      50A  B 16 20CHECK(LC)
     A                                      DSPATR(ND UL)
     A                                      COLOR(WHT)
     A                                 16 72'(2/2)'
     A                                      COLOR(BLU)
     A                                 17 20'^ Starts here'
     A                                      COLOR(BLU)
     A*=====================================================================
     A* Instructions
     A*=====================================================================
     A                                 18  2'Enter User Profile to load config.'
     A                                      COLOR(BLU)
     A                                 19  2'You may type changes at same time.'
     A                                      COLOR(BLU)
     A                                 20  2'Press Enter to save or F12 to exit'
     A                                      COLOR(BLU)
     A*=====================================================================
     A* Error Message Area
     A*=====================================================================
     A            ERRMSG        78A  O 21  2DSPATR(HI)
     A                                      COLOR(RED)
     A*=====================================================================
     A* Status Message Area
     A*=====================================================================
     A            STSMSG        78A  O 22  2COLOR(GRN)
     A*=====================================================================
     A* Function Keys
     A*=====================================================================
     A                                 23  2'F3=Exit  F12=Cancel'
     A                                      COLOR(BLU)